{
    "NAV": {
        "ABOUT": "Über mich",
        "SKILLS": "Skills",
        "PROJECTS": "Projekte",
        "CONTACT": "Kontakt"
    },
    "ABOUT_ME": {
        "SUBTITLE": "WER IST JOEL?",
        "TITLE": "ÜBER MICH",
        "DESCRIPTION": "Hey, ich bin Joel. Ich liebe Programmieren, weil jede Herausforderung mir hilft zu wachsen und meine Problemlösungsfähigkeiten zu schärfen. Es fordert mich heraus, kreativ zu denken und beharrlich zu bleiben, auch wenn es schwierig wird. Ich bin inspiriert von den endlosen Möglichkeiten, etwas aus dem Nichts zu erschaffen – nur durch das Schreiben von Code. Meine Programmierfähigkeiten zu verbessern gibt mir ein Gefühl von Fortschritt und Zweck. Es ist sowohl eine Leidenschaft als auch ein Werkzeug, um die Zukunft zu gestalten."
    },
    "SKILLS": {
        "INTRODUCTION": "Hier sind einige der Technologien und Werkzeuge, mit denen ich vertraut bin:",
        "SUBTITLE": "MEIN STACK",
        "TITLE": "Skill set",
        "PULLSTICKER": "Ich interessiere mich auch für:"
    },
    "PROJECTS": {
        "INTRODUCTION": "Schau dir gerne meine Projekte an und probiere sie aus. Mein Fokus liegt auf responsiven, benutzerfreundlichen Anwendungen mit sauberem und effizientem Code.",
        "SUBTITLE": "MEINE EXPERTISE",
        "TITLE": "PROJEKTE",
        "JOIN": "Task-Manager nach dem Kanban-Prinzip. Aufgaben erstellen, organisieren und per Drag-and-drop verwalten sowie Benutzer und Kategorien zuweisen.",
        "EPL": "Jump-and-Run-Spiel auf Basis objektorientierter Programmierung. Hilf Pepe, Münzen und Tabasco-Salsa zu sammeln, um gegen die verrückte Henne zu kämpfen.",
        "DABUBBLE": "Diese App ist ein Slack-Klon. Sie revolutioniert die Teamkommunikation und Zusammenarbeit durch eine intuitive Benutzeroberfläche, Echtzeit-Nachrichten und eine strukturierte Kanalorganisation."
    },
    "PROJECT_DETAILS": {
        "SUBTITLE": "Beschreibung",
        "SECOND_SUBTITLE": "Implementierungsdetails",
        "IMPLEMENT_TXT_JOIN": "Das Projekt wurde in einem dreiköpfigen Team entwickelt. Mein Fokus lag auf der Umsetzung interaktiver Benutzeroberflächen, der Aufgabenlogik sowie der sauberen Strukturierung des Codes für eine skalierbare und wartbare Anwendung.",
        "IMPLEMENT_TXT_EPL": "Das Spiel wurde entwickelt, um mein Verständnis objektorientierter Programmierung zu vertiefen. Zentrale Spielmechaniken, Kollisionslogik und Animationen wurden vollständig von Grund auf umgesetzt.",
        "IMPLEMENT_TXT_DABUBBLE": "Das Projekt wurde in einem dreiköpfigen Team umgesetzt. Der Schwerpunkt lag auf der Entwicklung moderner Webanwendungen, der Integration von Echtzeit-Kommunikation sowie der Zusammenarbeit in einem agilen Entwicklungsprozess.",
        "DURATION": "Dauer:",
        "DURATION_TIME_JOIN": "5 Wochen",
        "DURATION_TIME_EPL": "3 Wochen",
        "DURATION_TIME_DABUBBLE": "4 Wochen",
        "GO_BACK_BTN": "Zurück",
        "NEXT_PROJECT_BTN": "Nächstes Projekt"
    }
}