{
    "NAV": {
        "ABOUT": "Über mich",
        "SKILLS": "Skills",
        "PROJECTS": "Projekte",
        "CONTACT": "Kontakt"
    },
    "LANDING_PAGE": {
        "FRONTEND": "Frontend",
        "DEVELOPER": "Entwickler",
        "HELLO_WORLD": "Hallo Welt",
        "GET_IN_TOUCH_BTN": "Schreib mir"
    },
    "ABOUT_ME": {
        "SUBTITLE": "WER IST JOEL?",
        "TITLE": "ÜBER MICH",
        "DESCRIPTION": "Hey, ich bin Joel. Ich liebe Programmieren, weil jede Herausforderung mir hilft zu wachsen und meine Problemlösungsfähigkeiten zu schärfen. Es fordert mich heraus, kreativ zu denken und beharrlich zu bleiben, auch wenn es schwierig wird. Ich bin inspiriert von den endlosen Möglichkeiten, etwas aus dem Nichts zu erschaffen – nur durch das Schreiben von Code. Meine Programmierfähigkeiten zu verbessern gibt mir ein Gefühl von Fortschritt und Zweck. Es ist sowohl eine Leidenschaft als auch ein Werkzeug, um die Zukunft zu gestalten.",
        "LETS_TALK_BTN": "Lass uns reden"
    },
    "SKILLS": {
        "INTRODUCTION": "Hier sind einige der Technologien und Werkzeuge, mit denen ich vertraut bin:",
        "SUBTITLE": "MEIN STACK",
        "TITLE": "Skill set",
        "PULLSTICKER": "Ich interessiere mich auch für:"
    },
    "PROJECTS": {
        "INTRODUCTION": "Schau dir gerne meine Projekte an und probiere sie aus. Mein Fokus liegt auf responsiven, benutzerfreundlichen Anwendungen mit sauberem und effizientem Code.",
        "SUBTITLE": "MEINE EXPERTISE",
        "TITLE": "PROJEKTE",
        "JOIN": "Task-Manager nach dem Kanban-Prinzip. Aufgaben erstellen, organisieren und per Drag-and-drop verwalten sowie Benutzer und Kategorien zuweisen.",
        "EPL": "Jump-and-Run-Spiel auf Basis objektorientierter Programmierung. Hilf Pepe, Münzen und Tabasco-Salsa zu sammeln, um gegen die verrückte Henne zu kämpfen.",
        "DABUBBLE": "Diese App ist ein Slack-Klon. Sie revolutioniert die Teamkommunikation und Zusammenarbeit durch eine intuitive Benutzeroberfläche, Echtzeit-Nachrichten und eine strukturierte Kanalorganisation.",
        "PROJECT_DETAILS_BTN": "Projekt Details"
    },
    "PROJECT_DETAILS": {
        "SUBTITLE": "Beschreibung",
        "SECOND_SUBTITLE": "Implementierungsdetails",
        "IMPLEMENT_TXT_JOIN": "Das Projekt wurde in einem dreiköpfigen Team entwickelt. Mein Fokus lag auf der Umsetzung interaktiver Benutzeroberflächen, der Aufgabenlogik sowie der sauberen Strukturierung des Codes für eine skalierbare und wartbare Anwendung.",
        "IMPLEMENT_TXT_EPL": "Das Spiel wurde entwickelt, um mein Verständnis objektorientierter Programmierung zu vertiefen. Zentrale Spielmechaniken, Kollisionslogik und Animationen wurden vollständig von Grund auf umgesetzt.",
        "IMPLEMENT_TXT_DABUBBLE": "Das Projekt wurde in einem dreiköpfigen Team umgesetzt. Der Schwerpunkt lag auf der Entwicklung moderner Webanwendungen, der Integration von Echtzeit-Kommunikation sowie der Zusammenarbeit in einem agilen Entwicklungsprozess.",
        "DURATION": "Dauer:",
        "DURATION_TIME_JOIN": "5 Wochen",
        "DURATION_TIME_EPL": "3 Wochen",
        "DURATION_TIME_DABUBBLE": "4 Wochen",
        "GO_BACK_BTN": "Zurück",
        "NEXT_PROJECT_BTN": "Nächstes Projekt"
    },
    "COLLEAGUES": {
        "SUBTITLE": "IN IHREN WORTEN:",
        "TITLE": "Feedback von Kollegen",
        "CARD_TXT_1": "Die Zusammenarbeit mit Joel war super unkompliziert. Er hat immer den Überblick behalten und Dinge klar kommuniziert. Gerade wenn es stressig wurde, war er ruhig, hilfsbereit und lösungsorientiert – das hat dem ganzen Team echt geholfen.",
        "CARD_TXT_2": "Joel arbeitet sehr sauber und denkt stark aus Nutzerperspektive. Wenn jemand Fragen hatte oder festhing, war er sofort da und hat geholfen. Man merkt, dass er Spaß an Frontend-Entwicklung hat und gern Verantwortung übernimmt.",
        "CARD_TXT_3": "Joel war im Projekt sehr zuverlässig und engagiert. Er hat seine Aufgaben selbstständig erledigt und trotzdem immer im Team gedacht. Die Zusammenarbeit war angenehm und produktiv – genau so, wie man es sich wünscht.",
        "JOB": "Frontend-Entwickler"
    },
    "CONTACT": {
        "SUBTITLE": "Kontaktiere mich",
        "TITLE": "Bereit, gemeinsam zu arbeiten?",
        "INFO_TXT": "Ich begeistere mich für die Entwicklung sauberer, effizienter und benutzerfreundlicher digitaler Lösungen. Mit einer soliden Basis in modernen Webtechnologien und einem stetigen Lernwillen bringe ich sowohl technisches Know-how als auch kreatives Problemlösungsdenken in jedes Projekt ein. Besonders motiviert mich die Zusammenarbeit in innovativen Teams, um Ideen in wirkungsvolle Ergebnisse umzusetzen.",
        "NAME_FIELD": "Wie lautet dein Name?",
        "NAME_ERROR": "Ups! Dein Name fehlt noch.",
        "NAME_PLACEHOLDER": "Hier deinen Namen eingeben",
        "EMAIL_FIELD": "Wie lautet deine email?",
        "EMAIL_ERROR": "Bitte gib eine gültige email ein",
        "EMAIL_PLACEHOLDER": "deineemail@email.com",
        "HELP_FIELD": "Wie kann ich dir helfen?",
        "HELP_ERROR": "Hallo Joel, ich interessiere mich für...",
        "HELP_PLACEHOLDER": "Frag mich hier...",
        "PRIVACY_TXT": "Ich habe die Datenschutzerklärung gelesen und bin mit der Verarbeitung meiner Daten einverstanden.",
        "PRIVACY_HINT": "Bitte akzeptiere die Datenschutzerklärung.",
        "SEND_BTN": "Senden",
        "TOAST_SUCCESS": "✓ Nachricht wurde erfolgreich gesendet.",
        "TOAST_ERROR": "✕ Da ist etwas schiefgelaufen. Bitte versuche es noch einmal."
    },
    "FOOTER": {
        "LEGAL_NOTICE": "Impressum"
    },
    "LEGAL": {
        "TITLE": "Impressum",
        "IMPRINT_TITLE": "Impressum",
        "IMPRINT_TEXT": "Joel Baig\nHansestraße 92\n48282 Emsdetten",
        "PROJECT_TITLE": "Kontakt",
        "PROJECT_TEXT": "Exploring the board\nE-Mail: ibaig@web.de",
        "PORTFOLIO_LINK": "Portfolio",
        "DEV_AKADEMIE": "Developer Akademie GmbH",
        "TERMS_TITLE": "Nutzungsbedingungen",
        "TERMS_TEXT_1": "Durch den Zugriff auf und die Nutzung von ",
        "TERMS_TEXT_2": " erklärst du dich mit den folgenden Bedingungen einverstanden. Diese Hinweise können jederzeit ohne vorherige Ankündigung angepasst oder aktualisiert werden.",
        "SCOPE_TITLE": "Zweck und Eigentum des Produkts",
        "SCOPE_TEXT_1": " wurde im Rahmen eines studentischen Gruppenprojekts im Web-Development-Bootcamp der ",
        "SCOPE_TEXT_2": " entwickelt. Das Portfolio dient ausschließlich zu Lern- und Präsentationszwecken und ist nicht für eine umfangreiche private oder geschäftliche Nutzung vorgesehen. Daher kann keine Gewähr für dauerhafte Verfügbarkeit, Fehlerfreiheit oder inhaltliche Richtigkeit übernommen werden. Das Design von ",
        "SCOPE_TEXT_3": " ist Eigentum der ",
        "SCOPE_TEXT_4": " Eine unerlaubte Nutzung, Vervielfältigung, Veränderung oder Weitergabe des Designs ist nicht gestattet.",
        "RIGHTS_TITLE": "Urheber- und Schutzrechte",
        "RIGHTS_TEXT_1": "Abgesehen vom Design, das der ",
        "RIGHTS_TEXT_2": " gehört, behalten wir (die aufgeführten Studierenden) alle Rechte an eigenen Inhalten, Quellcodes und Materialien innerhalb des ",
        "USE_TITLE": "Zulässige Nutzung",
        "USE_TEXT": " darf ausschließlich im Rahmen geltender Gesetze genutzt werden. Eine Verwendung für rechtswidrige Zwecke oder zur Belästigung, Schädigung, Bedrohung oder Einschüchterung anderer Personen ist untersagt. Für sämtliche Interaktionen mit dem Portfolio bist du selbst verantwortlich.",
        "DISCLAIMER_TITLE": "Haftungsausschluss",
        "DISCLAIMER_TEXT_1": " wird ohne Gewährleistung jeglicher Art bereitgestellt. Weder wir (die aufgeführten Studierenden) noch die ",
        "DISCLAIMER_TEXT_2": " haften für direkte oder indirekte Schäden, die aus der Nutzung oder Nichtverfügbarkeit dieses Portfolios entstehen.",
        "INDEMNITY_TITLE": "Freistellung",
        "INDEMNITY_TEXT_1": "Du erklärst dich damit einverstanden, uns (die aufgeführten Studierenden), die ",
        "INDEMNITY_TEXT_2": " sowie deren Partner, Organe und Mitarbeitende von sämtlichen Ansprüchen, Schäden oder Kosten (einschließlich angemessener Anwaltskosten) freizustellen, die aus deiner Nutzung des ",
        "QUESTIONS_TEXT": "Bei Fragen oder Hinweisen erreichst du mich unter",
        "DATE_TEXT": "Stand: 13. Januar 2026"
    }
}