{
    "NAV": {
        "ABOUT": "About me",
        "SKILLS": "Skills",
        "PROJECTS": "Projects",
        "CONTACT": "Contact"
    },
    "LANDING_PAGE": {
        "FRONTEND": "Frontend",
        "DEVELOPER": "Developer",
        "HELLO_WORLD": "Hello world",
        "GET_IN_TOUCH_BTN": "Get in touch"
    },
    "ABOUT_ME": {
        "SUBTITLE": "WHO'S JOEL?",
        "TITLE": "About me",
        "DESCRIPTION": "Hey there, I´m Joel. I love programming because every challenge helps me grow and sharpen my problem-solving skills. It pushes me to think creatively and stay persistent, even when things get tough. I’m inspired by the endless possibilities of building something from nothing—just by writing code. Improving my coding skills gives me a sense of progress and purpose. It’s both a passion and a tool to shape the future.",
        "LETS_TALK_BTN": "Let´s talk"
    },
    "SKILLS": {
        "INTRODUCTION": "Here are some of the technologies and tools I'm familiar with:",
        "SUBTITLE": "MY STACK",
        "TITLE": "Skill set",
        "PULLSTICKER": "Also, I´m interested in diving into:"
    },
    "PROJECTS": {
        "INTRODUCTION": "Feel free to explore my projects and try things out! I focus on building responsive, user-friendly experiences with clean and efficient code.",
        "SUBTITLE": "MY CRAFT",
        "TITLE": "Projects",
        "JOIN": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users an categories.",
        "EPL": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen.",
        "DABUBBLE": "This App is a Slack Clone App. It revolutionizes team communication and collaboration with its intuitive interface, real-time messaging, and robust channel organization.",
        "PROJECT_DETAILS_BTN": "Project details"
    },
    "PROJECT_DETAILS": {
        "SUBTITLE": "Description",
        "SECOND_SUBTITLE": "Implementation Details",
        "IMPLEMENT_TXT_JOIN": "The project was developed in a team of three. I focused on building interactive user interfaces, implementing task logic, and ensuring a clean, maintainable code structure.",
        "IMPLEMENT_TXT_EPL": "The game was built to strengthen my understanding of object-oriented programming. Core game mechanics, collision logic, and animations were implemented entirely from scratch.",
        "IMPLEMENT_TXT_DABUBBLE": "Built in a group of three, this project focused on modern web application development, real-time communication features, and collaborative teamwork in an agile environment.",
        "DURATION": "Duration:",
        "DURATION_TIME_JOIN": "5 weeks",
        "DURATION_TIME_EPL": "3 weeks",
        "DURATION_TIME_DABUBBLE": "4 weeks",
        "GO_BACK_BTN": "Go back",
        "NEXT_PROJECT_BTN": "Next project"
    },
    "COLLEAGUES": {
        "SUBTITLE": "IN THEIR WORD´S:",
        "TITLE": "Colleague´s Thoughts",
        "CARD_TXT_1": "Working with Joel was very straightforward and enjoyable. He always kept a clear overview and communicated things in a simple, effective way. Especially during stressful moments, he stayed calm, helpful, and solution-focused – which really benefited the whole team.",
        "CARD_TXT_2": "Joel works very cleanly and always keeps the user in mind. Whenever someone got stuck or had a question, he was quick to help. You can tell that he genuinely enjoys frontend development and isn’t afraid to take responsibility.",
        "CARD_TXT_3": "Joel was reliable and highly committed throughout the project. He handled his tasks independently while still thinking as part of the team. The collaboration was smooth and productive – exactly what you want in a team member.",
        "JOB": "Frontend Developer"
    },
    "CONTACT": {
        "SUBTITLE": "CONTACT ME",
        "TITLE": "Ready to work together?",
        "INFO_TXT": "I’m passionate about creating clean, efficient, and user-friendly digital solutions. With a strong foundation inmodern web technologies and a constant drive to learn, I bring both technical expertise and creative problem-solving to every project. I’m excited to contribute to innovative teams and turn ideas into impactful results.",
        "NAME_FIELD": "What´s your name?",
        "NAME_ERROR": "Oops! it seems your name is missing",
        "NAME_PLACEHOLDER": "Your name goes here",
        "EMAIL_FIELD": "What´s your email?",
        "EMAIL_ERROR": "Please enter a valid email.",
        "EMAIL_PLACEHOLDER": "youremail@email.com",
        "HELP_FIELD": "How can I help you?",
        "HELP_ERROR": "Hello Joel, I am interested in...",
        "HELP_PLACEHOLDER": "Ask me here...",
        "PRIVACY_TXT": "I´ve read the privacy police and agree to the processing of my data as outlined.",
        "PRIVACY_HINT": "Please accept the privacy policy.",
        "SEND_BTN": "Send",
        "TOAST_SUCCESS": "✓ Message sent successfully",
        "TOAST_ERROR": "✕ Something went wrong. Please try again."
    },
    "FOOTER": {
        "LEGAL_NOTICE": "Legal Notice"
    },
    "LEGAL": {
        "TITLE": "Legal Notice",
        "IMPRINT_TITLE": "Imprint",
        "IMPRINT_TEXT": "Joel Baig\nHansestraße 92\n48282 Emsdetten",
        "PROJECT_TITLE": "Project",
        "PROJECT_TEXT": "Exploring the board\nEmail: ibaig@web.de",
        "PORTFOLIO_LINK": "Portfolio",
        "DEV_AKADEMIE": "Developer Akademie GmbH",
        "TERMS_TITLE": "Acceptance of terms",
        "TERMS_TEXT_1": "By accessing and using ",
        "TERMS_TEXT_2": " (Product), you acknowledge and agree to the following terms and conditions. We may update or change these terms from time to time without notice.",
        "SCOPE_TITLE": "Scope and ownership of the product",
        "SCOPE_TEXT_1": " has been developed as part of a student group project in a web development bootcamp at the ",
        "SCOPE_TEXT_2": " It has an educational purpose and is not intended for extensive personal or business usage. As such, we cannot guarantee consistent availability, reliability, accuracy, or any other aspect of quality regarding this product. The design of ",
        "SCOPE_TEXT_3": " is owned by the ",
        "SCOPE_TEXT_4": " Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited.",
        "RIGHTS_TITLE": "Proprietary rights",
        "RIGHTS_TEXT_1": "Aside from the design owned by ",
        "RIGHTS_TEXT_2": " we, the listed students, retain all proprietary rights in ",
        "USE_TITLE": "Use of the product",
        "USE_TEXT": " is intended to be used for lawful purposes only, in accordance with all applicable laws and regulations. Any use for illegal activities, or to harass, harm, threaten, or intimidate another person, is strictly prohibited. You are solely responsible for your interactions with other users of this product.",
        "DISCLAIMER_TITLE": "Disclaimer of warranties and limitation of liability",
        "DISCLAIMER_TEXT_1": " is provided \"as is\" without warranty of any kind, whether express or implied. In no event will we, the listed students, or the ",
        "DISCLAIMER_TEXT_2": " be liable for any direct, indirect, incidental, special, consequential, or exemplary damages arising out of or in connection with the use or performance of this product.",
        "INDEMNITY_TITLE": "Indemnity",
        "INDEMNITY_TEXT_1": "You agree to indemnify, defend, and hold harmless us, the listed students, the ",
        "INDEMNITY_TEXT_2": " and our affiliates, partners, officers, directors, agents, and employees from any claim, demand, loss, damage, cost, or liability (including reasonable legal fees) arising out of or relating to your use of ",
        "QUESTIONS_TEXT": "For any questions or notices, please contact us at",
        "DATE_TEXT": "Date: January 13, 2026"
    }
}