{
    "NAV": {
        "ABOUT": "About me",
        "SKILLS": "Skills",
        "PROJECTS": "Projects",
        "CONTACT": "Contact"
    },
    "ABOUT_ME": {
        "SUBTITLE": "WHO'S JOEL?",
        "TITLE": "About me",
        "DESCRIPTION": "Hey there, I´m Joel. I love programming because every challenge helps me grow and sharpen my problem-solving skills. It pushes me to think creatively and stay persistent, even when things get tough. I’m inspired by the endless possibilities of building something from nothing—just by writing code. Improving my coding skills gives me a sense of progress and purpose. It’s both a passion and a tool to shape the future."
    },
    "SKILLS": {
        "INTRODUCTION": "Here are some of the technologies and tools I'm familiar with:",
        "SUBTITLE": "MY STACK",
        "TITLE": "Skill set",
        "PULLSTICKER": "Also, I´m interested in diving into:"
    },
    "PROJECTS": {
        "INTRODUCTION": "Feel free to explore my projects and try things out! I focus on building responsive, user-friendly experiences with clean and efficient code.",
        "SUBTITLE": "MY CRAFT",
        "TITLE": "PROJECTS",
        "JOIN": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users an categories.",
        "EPL": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen.",
        "DABUBBLE": "This App is a Slack Clone App. It revolutionizes team communication and collaboration with its intuitive interface, real-time messaging, and robust channel organization."
    },
    "PROJECT_DETAILS": {
        "SUBTITLE": "Description",
        "SECOND_SUBTITLE": "Implementation Details",
        "IMPLEMENT_TXT_JOIN": "The project was developed in a team of three. I focused on building interactive user interfaces, implementing task logic, and ensuring a clean, maintainable code structure.",
        "IMPLEMENT_TXT_EPL": "The game was built to strengthen my understanding of object-oriented programming. Core game mechanics, collision logic, and animations were implemented entirely from scratch.",
        "IMPLEMENT_TXT_DABUBBLE": "Built in a group of three, this project focused on modern web application development, real-time communication features, and collaborative teamwork in an agile environment.",
        "DURATION": "Duration:",
        "DURATION_TIME_JOIN": "5 weeks",
        "DURATION_TIME_EPL": "3 weeks",
        "DURATION_TIME_DABUBBLE": "4 weeks",
        "GO_BACK_BTN": "Go back",
        "NEXT_PROJECT_BTN": "Next project"
    },
    "COLLEAGUES": {
        "SUBTITLE": "IN THEIR WORD´S:",
        "TITLE": "Colleague´s Thoughts",
        "CARD_TXT_1": "Working with Joel was very straightforward and enjoyable. He always kept a clear overview and communicated things in a simple, effective way. Especially during stressful moments, he stayed calm, helpful, and solution-focused – which really benefited the whole team.",
        "CARD_TXT_2": "Joel works very cleanly and always keeps the user in mind. Whenever someone got stuck or had a question, he was quick to help. You can tell that he genuinely enjoys frontend development and isn’t afraid to take responsibility.",
        "CARD_TXT_3": "Joel was reliable and highly committed throughout the project. He handled his tasks independently while still thinking as part of the team. The collaboration was smooth and productive – exactly what you want in a team member.",
        "JOB": "Frontend Developer"
    },
    "CONTACT": {
        "SUBTITLE": "CONTACT ME",
        "TITLE": "Ready to work together?",
        "INFO_TXT": "I’m passionate about creating clean, efficient, and user-friendly digital solutions. With a strong foundation inmodern web technologies and a constant drive to learn, I bring both technical expertise and creative problem-solving to every project. I’m excited to contribute to innovative teams and turn ideas into impactful results.",
        "NAME_FIELD": "What´s your name?",
        "NAME_ERROR": "Oops! it seems your name is missing",
        "NAME_PLACEHOLDER": "Your name goes here",
        "EMAIL_FIELD": "What´s your email?",
        "EMAIL_ERROR": "Please enter a valid email.",
        "EMAIL_PLACEHOLDER": "youremail@email.com",
        "HELP_FIELD": "How can I help you?",
        "HELP_ERROR": "Hello Joel, I am interested in...",
        "HELP_PLACEHOLDER": "Ask me here...",
        "PRIVACY_TXT": "I´ve read the privacy police and agree to the processing of my data as outlined.",
        "PRIVACY_HINT": "Please accept the privacy policy.",
        "SEND_BTN": "Send",
        "TOAST_SUCCESS": "✓ Message sent successfully",
        "TOAST_ERROR": "✕ Something went wrong. Please try again."
    }
}